# Systems Analysis Options Output Folder Property

Source: https://www.revitapidocs.com/2026/d980a989-f63a-17a4-b431-596b8884afb5.htm

---

| Systems Analysis Options Output Folder Property |
| --- |

The path of the output folder for systems analysis.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string OutputFolder { get; set; }
```

```
Public Property OutputFolder As String
	Get
	Set
```

```
public:
property String^ OutputFolder {
	String^ get ();
	void set (String^ value);
}
```

```
member OutputFolder : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The analysis requires a valid output folder path or empty string. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks When requesting a new system analysis, it is okay to have an empty output folder in the SystemsAnalysisOption. In that case,
 the ViewSystemsAnalysisReport would supply the output folder, typically at the system TEMP folder. See Also

#### Reference

SystemsAnalysisOptions Class Autodesk.Revit.DB.Analysis Namespace